# Data cleaning and Pre-processing

Why do we **preprocess** data when we build machine learning pipelines?

We preprocess data for two principle reasons:

1. To transform the data to better suit a model's underlying assumptions.
2. To format the data in the way a model expects.

# Pandas
### Pandas: derived from 'panel data'
### Based on NumPy.
### Usage: cleaning, transforming and analyzing data.
### Used with:
- Matplotlib : visualize data.
- SciPy: statistical analysis.
- Scikit-learn: ML algorithms.

In [1]:
import pandas as pd
import numpy as np

# Dataset: alldata.csv
## Source: Kaggle

## Dataframe

In [2]:
df = pd.read_csv("Resources/alldata.csv")
#df

## Viewing the data

In [3]:
df.head() # Shows the top 5 rows
#df.tail() # Shows last 5 rows

,position,company,description,reviews,location
0,Development Director,ALS TDI,Development Director\nALS Therapy Development ...,NaN,"Atlanta, GA 30301"
1,An Ostentatiously-Excitable Principal Research...,The Hexagon Lavish,"Job Description\n\n""The road that leads to acc...",NaN,"Atlanta, GA"
2,Data Scientist,Xpert Staffing,"Growing company located in the Atlanta, GA are...",NaN,"Atlanta, GA"
3,Data Analyst,Operation HOPE,DEPARTMENT: Program OperationsPOSITION LOCATIO...,44.0,"Atlanta, GA 30303"
4,Assistant Professor -TT - Signal Processing & ...,Emory University,DESCRIPTION\nThe Emory University Department o...,550.0,"Atlanta, GA"

### Getting info about the dataframe

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6964 entries, 0 to 6963
Data columns (total 5 columns):
position       6953 non-null object
company        6953 non-null object
description    6953 non-null object
reviews        5326 non-null float64
location       6953 non-null object
dtypes: float64(1), object(4)
memory usage: 272.1+ KB

In [5]:
df.shape

(6964, 5)

#### Handling duplicates: How to get rid of duplicate rows

In this case, there are no duplicate rows.

In [6]:
temp = df.append(df)
temp.shape

#https://www.learndatasci.com/tutorials/python-pandas-tutorial-complete-introduction-for-beginners/

(13928, 5)

In [7]:
#duplicateRowsDF = temp[temp.duplicated()] #.duplicated() finds duplicate rows
#print("Duplicate Rows except first occurrence based on all columns are :")
#print(duplicateRowsDF)

temp.drop_duplicates().shape


#https://thispointer.com/pandas-find-duplicate-rows-in-a-dataframe-based-on-all-or-selected-columns-using-dataframe-duplicated-in-python/

(6954, 5)

### Working with missing values
- Remove rows/cols with nulls
- Impute (Null values substituted by non-null values)

In [8]:
#df.isnull() # If missing -> True. 
df.isnull().sum() # number of nulls/missing values in each col. 
#df.head()

position         11
company          11
description      11
reviews        1638
location         11
dtype: int64

#### Removing missing values

In [9]:
# Dropping rows with nulls
df.dropna(inplace = True) # inplace = True creates a modified dataframe.
df.isnull().sum()
# Dropping cols
#df.dropna(axis=1)

position       0
company        0
description    0
reviews        0
location       0
dtype: int64

#### Imputation : Substitute nulls by non-nulls
- To avoid removing portions of dataset by dropping null values, replace the nulls by mean/median of the cols.
  - Pick up the col/cols.
  - Find the mean/median of that col/cols.
  - Fill nulls by mean/median.

In [12]:
# We start with the original dataframe df.

df = pd.read_csv("Resources/alldata.csv")
df.isnull().sum()

position         11
company          11
description      11
reviews        1638
location         11
dtype: int64

In [13]:
reviews = df['reviews']
reviews.head()

0      NaN
1      NaN
2      NaN
3     44.0
4    550.0
Name: reviews, dtype: float64

In [14]:
reviews_mean = reviews.mean()
#reviews_mean
reviews.fillna(reviews_mean, inplace = True)

In [15]:
df.isnull().sum()

position       11
company        11
description    11
reviews         0
location       11
dtype: int64

### Distribution of continuous variables

In [16]:
df.describe()
#df['reviews'].describe()
#df.corr()   # Correlation between the continuous variables.

             reviews
count    6964.000000
mean     3179.089185
std      7388.256948
min         2.000000
25%        61.000000
50%       641.000000
75%      3179.089185
max    148114.000000

### Selecting cols/rows in dataframe

In [17]:
X = df[['position', 'location']] # selecting cols
X.head()

                                            position            location
0                               Development Director  Atlanta, GA 30301
1  An Ostentatiously-Excitable Principal Research...         Atlanta, GA
2                                     Data Scientist         Atlanta, GA
3                                       Data Analyst  Atlanta, GA 30303
4  Assistant Professor -TT - Signal Processing & ...         Atlanta, GA

In [18]:
#Selecting rows : iloc = index location; locating using numerical index.
df_subset = df.iloc[1]
df_subset = df.iloc[1:4]
df_subset

,position,company,description,reviews,location
1,An Ostentatiously-Excitable Principal Research...,The Hexagon Lavish,"Job Description\n\n""The road that leads to acc...",3179.089185,"Atlanta, GA"
2,Data Scientist,Xpert Staffing,"Growing company located in the Atlanta, GA are...",3179.089185,"Atlanta, GA"
3,Data Analyst,Operation HOPE,DEPARTMENT: Program OperationsPOSITION LOCATIO...,44.000000,"Atlanta, GA 30303"

In [19]:
# Selecting rows: loc: using name
 
#If the indexing was based on names, then we could have used df.loc['name1']

### Conditional selections

E.g.: We want to select the Data Analyst position

In [20]:
df[df['position'] == "Data Analyst"]
#df[(df['position'] == "Data Analyst")| (df['position'] == "Data Scientist")]


#Concise way of selecting more than one option : isin()

#df[df['position'].isin(['Data Analyst', 'Data Scientist'])]

,position,company,description,reviews,location
3,Data Analyst,Operation HOPE,DEPARTMENT: Program OperationsPOSITION LOCATIO...,44.000000,"Atlanta, GA 30303"
298,Data Analyst,Applied Systems Inc.,Job Description\nMake a Difference Every Day w...,74.000000,"Austin, TX"
1363,Data Analyst,TrueMotion,At TrueMotion we’re motivated by three things:...,3179.089185,"Boston, MA"
2247,Data Analyst,Uptown Treehouse,The Data Scientist will lead the charge in lev...,3179.089185,"Los Angeles, CA 90028"
2498,Data Analyst,Amazon.com,Job Description\nThe Alexa Information team st...,25902.000000,"Cambridge, MA"
2502,Data Analyst,Panjiva,----------------------------------------\nSolv...,2.000000,"Cambridge, MA"
3567,Data Analyst,DEPARTMENT OF FINANCE,NYC Department of Finance (DOF) is responsible...,108.000000,"Manhattan, NY"
3864,Data Analyst,Bowery Farming,The Role\n\nThis is an opportunity to join a s...,8.000000,"New York, NY"
4177,Data Analyst,Source One,Requirements: 3-5 years of digital analytics e...,98.000000,"New York, NY 10001"
4272,Data Analyst,WeWork Global Technology,WeWork Mission\n\nWeWork is the platform for c...,3179.089185,"New York, NY"
4282,Data Analyst,Schireson,Who We’re Looking For\n\nWe are looking for a ...,3179.089185,"New York, NY"
4308,Data Analyst,Dashlane,Dashlane is a password manager and online secu...,3179.089185,"New York, NY 10010"
4313,Data Analyst,"Starry, Inc.",Starry is seeking a Data Analyst to join the g...,3179.089185,"New York, NY"
4361,Data Analyst,ADMIN FOR CHILDREN'S SVCS,The Division of Child Protection (DCP) investi...,159.000000,"Manhattan, NY"
4376,Data Analyst,NewsCred,Company Description\n-------------------\n\nAt...,2.000000,"New York, NY 10016"
4433,Data Analyst,Microsoft,Data Analyst – Xbox Game Pass (Data &amp; Insi...,4618.000000,"Redmond, WA 98052"
4572,Data Analyst,Motive Interactive,Motive Interactive is a global mobile app opti...,3.000000,"San Diego, CA 92121"
6475,Data Analyst,Yodlee,Bird’s eye view of your role –\nYodlee’s Data ...,59.000000,"Redwood City, CA 94065"
6482,Data Analyst,Elsevier,"As a Senior Data Analyst, you will work with P...",476.000000,"Berkeley, CA"
6546,Data Analyst,Energy Solutions,"Founded in 1995, Energy Solutions is an employ...",79.000000,"Oakland, CA 94612"
6614,Data Analyst,Glu Mobile,"Role Overview:\n\nAs a Data Analyst, you will ...",15.000000,"San Francisco, CA"
6637,Data Analyst,NinthDecimal,NinthDecimal is the marketing platform powered...,4.000000,"San Francisco, CA"

### Applying function : apply()

In [21]:
def review_func(x):
    if x >= 8000:
        return "good"
    else:
        return "bad"

In [22]:
df["rating"] = df["reviews"].apply(review_func) # Adds a new col 'rating'
df.head(10)

,position,company,description,reviews,location,rating
0,Development Director,ALS TDI,Development Director\nALS Therapy Development ...,3179.089185,"Atlanta, GA 30301",bad
1,An Ostentatiously-Excitable Principal Research...,The Hexagon Lavish,"Job Description\n\n""The road that leads to acc...",3179.089185,"Atlanta, GA",bad
2,Data Scientist,Xpert Staffing,"Growing company located in the Atlanta, GA are...",3179.089185,"Atlanta, GA",bad
3,Data Analyst,Operation HOPE,DEPARTMENT: Program OperationsPOSITION LOCATIO...,44.000000,"Atlanta, GA 30303",bad
4,Assistant Professor -TT - Signal Processing & ...,Emory University,DESCRIPTION\nThe Emory University Department o...,550.000000,"Atlanta, GA",bad
5,Manager of Data Engineering,McKinsey & Company,Qualifications\nBachelor’s degree in Computer ...,385.000000,"Atlanta, GA 30318",bad
6,"Product Specialist - Periscope, New Ventures",McKinsey & Company,Qualifications\nBachelor’s degree\n5-7 years o...,385.000000,"Atlanta, GA 30318",bad
7,"Junior to Mid-level Engineer, Geologist or Env...",Wood,Overview / Responsibilities\nWood Environment ...,899.000000,"Atlanta, GA",bad
8,Analyst - CIB Credit Research,SunTrust,Works closely with senior CIB professionals. P...,3343.000000,"Atlanta, GA",bad
9,Senior Associate - Cognitive Data Scientist Na...,KPMG,Known for being a great place to work and buil...,4494.000000,"Atlanta, GA 30338",bad

## Plotting
- For discrete variables: use bar charts and boxplots
- For continuous variables, use scatterplots, line graphs, histograms and boxplots

In [23]:
import matplotlib.pyplot as plt

#Scatter plot
#plt.scatter(df.values[:,3], df.values[:,5])

#boxplot using matplotlib
plt.boxplot(df['reviews'])
plt.show()

#boxplot using dataframe 
#fig = plt.figure()
#axes = fig.add_axes([0,0,1,1]) #l,b,w,h
#bxplt = df.boxplot(column = 'reviews', by = 'rating', ax = axes)

# Encoding Categorical Values - Working with Categorical Data

Many Machine Learning algorithms can not handle categorial variables unless we convert them to numerical values. Many algorithm’s performances vary based on how Categorical variables are encoded.
Categorical variables can be divided into two categories: Nominal (No particular order) and Ordinal (some ordered).
This section will cover 1) One Hot Encoding, 2) Label Encoding, 3) Ordinal Encoding, 5) Binary Encoding and 6) Frequency Encoding

In [24]:
# We are going to create a dataframe for this

data = {'Temperature':['Hot','Cold','Very Hot','Warm','Hot','Warm','Warm','Hot','Hot','Cold'],
        'Color':['Read','Yellow','Blue','Blue','Red','Yellow','Red','Yellow','Yellow','Yellow'],
        'Target':[1,1,1,0,1,0,1,0,1,1]}
df = pd.DataFrame(data,columns=['Temperature','Color','Target'])
df.head()

  Temperature   Color  Target
0         Hot    Read       1
1        Cold  Yellow       1
2    Very Hot    Blue       1
3        Warm    Blue       0
4         Hot     Red       1

## One Hot Encoding
In this method, we map each category to a vector that contains 1 and 0 denoting the presence or absence of the feature. The number of vectors depends on the number of categories for features. This method produces a lot of columns that slows down the learning significantly if the number of the category is very high for the feature. 


#### Dummy Encoding with Pandas (Binary Encoded Data)
Pandas has get_dummies function, which is quite easy to use.

Dummy Encoding transforms each categorical feature into new columns with a 1 (True) or 0 (False) encoding to represent if that categorical label was present or not in the original row.

In [25]:
# We can specify which column to encode using get_dummies

data = df.copy()

data_binary_encoded = pd.get_dummies(data, prefix=['Temp'],columns=["Temperature"])
data_binary_encoded.head()

    Color  Target  Temp_Cold  Temp_Hot  Temp_Very Hot  Temp_Warm
0    Read       1          0         1              0          0
1  Yellow       1          1         0              0          0
2    Blue       1          0         0              1          0
3    Blue       0          0         0              0          1
4     Red       1          0         1              0          0

In [26]:
# Or we can encode multiple columns using `get_dummies`.

data = df.copy()

data_binary_encoded = pd.get_dummies(data)
data_binary_encoded.head()

,Target,Temperature_Cold,Temperature_Hot,Temperature_Very Hot,Temperature_Warm,Color_Blue,Color_Read,Color_Red,Color_Yellow
0,1,0,1,0,0,0,1,0,0
1,1,1,0,0,0,0,0,0,1
2,1,0,0,1,0,1,0,0,0
3,0,0,0,0,1,1,0,0,0
4,1,0,1,0,0,0,0,1,0

## Label Encoding

Label Encoding simply encodes each category as an integer value. In this encoding, each category is assigned a value from 1 through N (here N is the number of categories for the feature. One major issue with this approach is there is no relation or order between these classes, but the algorithm might consider them as some order, or there is some relationship. 

Sklearn provides a preprocessing library to assist with this. Pandas can also do this.

Beware that some models are sensitive to Integer Encoding!

Distance equations in clustering algorithms are particularly sensitive.

In [27]:
# using sk learn
from sklearn.preprocessing import LabelEncoder
data = df.copy()

data['Temp_label_encoded'] = LabelEncoder().fit_transform(data.Temperature)
data

  Temperature   Color  Target  Temp_label_encoded
0         Hot    Read       1                   1
1        Cold  Yellow       1                   0
2    Very Hot    Blue       1                   2
3        Warm    Blue       0                   3
4         Hot     Red       1                   1
5        Warm  Yellow       0                   3
6        Warm     Red       1                   3
7         Hot  Yellow       0                   1
8         Hot  Yellow       1                   1
9        Cold  Yellow       1                   0

In [28]:
# using pandas
data = df.copy()

data['Temp_factorize_encode'] = pd.factorize(data['Temperature'])[0].reshape(-1,1)
data

  Temperature   Color  Target  Temp_factorize_encode
0         Hot    Read       1                      0
1        Cold  Yellow       1                      1
2    Very Hot    Blue       1                      2
3        Warm    Blue       0                      3
4         Hot     Red       1                      0
5        Warm  Yellow       0                      3
6        Warm     Red       1                      3
7         Hot  Yellow       0                      0
8         Hot  Yellow       1                      0
9        Cold  Yellow       1                      1

## Binary Encoding

Binary encoding converts a category into binary digits. Each binary digit creates one feature column. If there are **n** unique categories, then binary encoding results in the only **log(base 2)ⁿ** features. In this example, we have four features; thus, the total number of the binary encoded features will be three features. 

Compared to One Hot Encoding, Binary encoding will require fewer feature columns (for 100 categories One Hot Encoding will have 100 features while for Binary encoding, we will need just seven feature). In other words, it is more memory efficient

For Binary encoding, one has to follow the following steps:
* The categories are first converted to numeric order starting from 1 (order is created as categories appear in a dataset and do not mean any ordinal nature)
* Then those integers are converted into binary code, so for example 3 becomes 011, 4 becomes 100
* Then the digits of the binary number form separate columns.

Refer to the below diagram for better intuition.

<img src="img/binaryencodingEx.png" width=60% height=60% />

In [29]:
# we will be using another library called category_encoders
# pip install category_encoders
import category_encoders as ce

data = df.copy()

encoder = ce.BinaryEncoder(cols=['Temperature'])
df_binary = encoder.fit_transform(data)

df_binary.head()

   Temperature_0  Temperature_1  Temperature_2   Color  Target
0              0              0              1    Read       1
1              0              1              0  Yellow       1
2              0              1              1    Blue       1
3              1              0              0    Blue       0
4              0              0              1     Red       1

## Frequency Encoding

It is a way to utilize the frequency of the categories as labels. In the cases where the frequency is related somewhat with the target variable, it helps the model to understand and assign the weight in direct and inverse proportion, depending on the nature of the data. 

Three-step for this :
* Select a categorical variable you would like to transform
* Group by the categorical variable and obtain counts of each category
* Join it back with the training dataset

In [30]:
data = df.copy()

fe = data.groupby('Temperature').size()/len(data)
data['Temp_freq_encode'] = data['Temperature'].map(fe)
data

  Temperature   Color  Target  Temp_freq_encode
0         Hot    Read       1               0.4
1        Cold  Yellow       1               0.2
2    Very Hot    Blue       1               0.1
3        Warm    Blue       0               0.3
4         Hot     Red       1               0.4
5        Warm  Yellow       0               0.3
6        Warm     Red       1               0.3
7         Hot  Yellow       0               0.4
8         Hot  Yellow       1               0.4
9        Cold  Yellow       1               0.2

<img src="img/categorical-encoding-Tree.png"/>





Sources: https://innovation.alteryx.com/encode-smarter/, https://towardsdatascience.com/all-about-categorical-variable-encoding-305f3361fd02